#ifndef CONFIGURATION_H_
#define CONFIGURATION_H_

/********************** Programm version ***********************/

extern const volatile uint8_t version[4];	// массив с байтами версии программы подробнее в configuration.c






/*
*****************************************************************
*																*
*						Macros version board					*
*																*
*****************************************************************

	Здесь располагаются все версии плат блока управления в зависимости от версии платы настраивается переферия 
	и меняется логика взаимодействия с устройствами

*/

#define board_v_1_0_0 // первая версия платы управления




#endif